import streamlit as st
import pandas as pd
import tensorflow as tf
import numpy as np
import pandas as pd
from sklearn.model_selection import train_test_split

def get_test_inputs():
	x = tf.constant(test_set.data)
	y = tf.constant(test_set.target)

	return x, y


def get_train_inputs():
	x = tf.constant(training_set.data)
	y = tf.constant(training_set.target)

	return x, y

def pin():
        #return np.asarray([z] ,dtype=np.int)
        return np.array([[0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0,
	1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0,
	0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0,
	0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0,
	0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0,
	0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 1,
	0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
	1, 0, 1, 0, 0, 0, 0]], dtype=np.int)
        
c1={
'Раструб':'100000',
'Коническая':'010000',
'Выпуклая':'001000',
'Плоская':'000100',
'С выступом':'000010',
'Углубленная':'000001',
}
c2={
'Волокнистая':'1000',
'С углублениями':'0100',
'Чешуйчатая':'0010',
'Гладкая':'0001',
}
c3={
'Коричневый':'10000000',
'Кожа':'01000000',
'Корица':'00100000',
'Серый':'00010000',
'Розовый':'00001000',
'Красный':'00000100',
'Белый':'00000010',
'Желтый':'00000001',
}
c4={
'Есть':'10',
'Отсутствуют':'01',
}
c5={
'Миндаль':'1000000',
'Анис':'0100000',
'Креозот':'0010000',
'Неприятный':'0001000',
'Затхлый':'0000100',
'Отсутствует':'0000010',
'Едкий':'0000001',
}
c6={
'Приклеплены стандартно':'10',
'Свободно':'01',
}
c7={
'Близко':'10',
'Скучено':'01',
}
c8={
'Широкие':'10',
'Узкие':'01',
}
c9={
'Черный':'100000000',
'Коричневый':'010000000',
'Шоколадный':'001000000',
'Серый':'000100000',
'Зеленый':'000010000',
'Розовый':'000001000',
'Фиолетовый':'000000100',
'Белый':'0000000010',
'Желтый':'000000001',
}
c10={
'Увеличение':'10',
'Сужение':'01',
}
c11={
'Луковичный':'1000',
'Клубни':'0100',
'Равный':'0010',
'Укоренившийся':'0001',
}
c12={
'Волокнистый':'1000',
'Чешуйчатый':'0100',
'Шелковистый':'0010',
'Гладкий':'0001',
}
c13={
'Волокнистый':'1000',
'Чешуйчатый':'0100',
'Шелковистый':'0010',
'Гладкий':'0001',
}
c14={
'Коричневый':'1000000',
'Кожа буйвола':'0100000',
'Корица':'0010000',
'Серый':'0001000',
'Розовый':'0000100',
'Белый':'0000010',
'Желтый':'0000001',
}
c15={
'Коричневый':'1000000',
'Кожа буйвола':'0100000',
'Корица':'0010000',
'Серый':'0001000',
'Розовый':'0000100',
'Белый':'0000010',
'Желтый':'0000001',
}
c16={
'Частичный':'1',
'Полный':'0'
}
c17={
'Белый':'10',
'Желтый':'01',
}
c18={
'0':'100',
'1':'010',
'2':'001',
}
c19={
'Исчезающий':'1000',
'Большой':'0100',
'Отсутствует':'0010',
'Кулон':'0001',
}
c20={
'Черный':'100000',
'Коричневый':'010000',
'Шоколад':'001000',
'Зеленый':'000100',
'Оранжевый':'000010',
'Белый':'000001',
}
c21={
'Обильная':'100000',
'Сгруппированная':'010000',
'Многочисленная':'001000',
'Разбросанная':'000100',
'Несколько':'000010',
'Одиночная':'000001',
}
c22={
'Трава':'1000',
'Листья':'0100',
'Луга':'0010',
'Леса':'0001',
}
a1= st.radio("Форма шляпки", ('Раструб', 'Коническая', 'Выпуклая','Плоская','С выступом','Углубленная'))
a2 = st.radio("Поверхность шляпки", ('Волокнистая', 'С углублениями', 'Чешуйчатая','Гладкая'))
a3 = st.radio("Цвет шляпки", ('Коричневый', 'Кожа', 'Корица','Серый','Розовый','Красный','Белый','Желтый'))
a4 = st.radio("Ушибы",('Есть','Отсутствуют'))
a5 = st.radio("Запах",('Миндаль','Анис','Креозот','Неприятный','Затхлый','Отсутствует','Едкий'))
a6 = st.radio("Приклепление жабр",('Приклеплены стандартно','Свободно'))
a7 = st.radio("Растояние между жабрами",('Близко','Скучено'))
a8 = st.radio("Размер жабр",('Широкие','Узкие'))
a9 = st.radio("Цвет жабр",('Черный','Коричневый','Шоколадный','Серый','Зеленый','Розовый','Фиолетовый','Белый','Желтый'))
a10 = st.radio("Форма ножки",('Увеличение','Сужение'))
a11 = st.radio("Корень ножки",('Луковичный','Клубни','Равный','Укоренившийся'))
a12 = st.radio("Поверхность стебля над кольцом",('Волокнистый','Чешуйчатый','Шелковистый','Гладкий'))
a13 = st.radio("Поверхность стебля под кольцом",('Волокнистый','Чешуйчатый','Шелковистый','Гладкий'))
a14 = st.radio("Цвет ножки над кольцом",('Коричневый','Кожа буйвола','Корица','Серый','Розовый','Белый','Желтый'))
a15 = st.radio("Цвет ножки под кольцом",('Коричневый','Кожа буйвола','Корица','Серый','Розовый','Белый','Желтый'))
a16 = st.radio("Тип вуали",('Частичный','Полный'))
a17 = st.radio("Цвет вуали",('Белый','Белый'))
a18 = st.radio("Число колец",('0','1','2'))
a19 = st.radio("Тип кольца",('Исчезающий','Большой','Отсутствует','Кулон'))
a20 = st.radio("Цвет спор",('Черный','Коричневый','Шоколад','Зеленый','Оранжевый','Белый'))
a21 = st.radio("Популяция",('Обильная','Сгруппированная','Многочисленная','Разбросанная','Несколько','Одиночная'))
a22 = st.radio("Среда обитания",('Трава','Листья','Луга','Леса'))
btn=st.button('Определить')
if btn:
 i=''
 i=i+c1[a1]
 i=i+c2[a2]
 i=i+c3[a3]
 i=i+c4[a4]
 i=i+c5[a5]
 i=i+c6[a6]
 i=i+c7[a7]
 i=i+c8[a8]
 i=i+c9[a9]
 i=i+c10[a10]
 i=i+c11[a11]
 i=i+c12[a12]
 i=i+c13[a13]
 i=i+c14[a14]
 i=i+c15[a15]
 i=i+c16[a16]
 i=i+c17[a17]
 i=i+c18[a18]
 i=i+c19[a19]
 i=i+c20[a20]
 i=i+c21[a21]
 i=i+c22[a22]
 z = list(i)
 z=list(map(int, z))
 training_set = tf.contrib.learn.datasets.base.load_csv_with_header(
 filename='mushroom_train.csv',
 target_dtype=np.int,
 features_dtype=np.int,
 target_column=0)
 test_set = tf.contrib.learn.datasets.base.load_csv_with_header(
 filename='mushroom_test.csv',
 target_dtype=np.int,
 features_dtype=np.int,
 target_column=0)
 feature_columns = [tf.contrib.layers.real_valued_column("", dimension=98)]
 model = tf.contrib.learn.DNNClassifier(
 feature_columns=feature_columns,
 hidden_units=[10, 20, 10],
 n_classes=2,
 model_dir="/tmp/mushroom_model")
 rt=np.array([[0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0,
	1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0,
	0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0,
	0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0,
	0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0,
	0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 1,
	0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
	1, 0, 1, 0, 0, 0, 0]], dtype=np.int)
 pred=list(model.predict_classes(rt))
 if pred[0]==0:
  w=st.write('Гриб съедобен')
 if pred[0]==1:
  w=st.write('Гриб ядовит')
